Tekla Open API Reference for Tekla Structures 2025
RebarSpacing.Clone Method
 Makes a copy of this object.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RebarSpacing Clone()
Public Function Clone As RebarSpacing
Return Value
Type: RebarSpacing
a new RebarSpacing instance.
See Also
Reference
RebarSpacing Class
Tekla.Structures.Model Namespace